MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFF100/mcu.h
extern volatile __USBDMA6Abits_t USBDMA6Abits __asm__ ("USBDMA6A") __attribute__((section("sfrs"), address(0xBF8E3258)));
#define USBDMA6N USBDMA6N
extern volatile uint32_t   USBDMA6N __attribute__((section("sfrs"), address(0xBF8E325C)));
typedef struct {
  uint32_t DMACOUNT:32;
} __USBDMA6Nbits_t;
extern volatile __USBDMA6Nbits_t USBDMA6Nbits __asm__ ("USBDMA6N") __attribute__((section("sfrs"), address(0xBF8E325C)));
#define USBDMA7C USBDMA7C
extern volatile uint32_t   USBDMA7C __attribute__((section("sfrs"), address(0xBF8E3264)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t DMADIR:1;
  uint32_t DMAMODE:1;
  uint32_t DMAIE:1;
  uint32_t DMAEP:4;
  uint32_t DMAERR:1;
  uint32_t DMABRSTM:2;
} __USBDMA7Cbits_t;
extern volatile __USBDMA7Cbits_t USBDMA7Cbits __asm__ ("USBDMA7C") __attribute__((section("sfrs"), address(0xBF8E3264)));
#define USBDMA7A USBDMA7A
extern volatile uint32_t   USBDMA7A __attribute__((section("sfrs"), address(0xBF8E3268)));
typedef struct {
  uint32_t DMAADDR:32;
} __USBDMA7Abits_t;
extern volatile __USBDMA7Abits_t USBDMA7Abits __asm__ ("USBDMA7A") __attribute__((section("sfrs"), address(0xBF8E3268)));
#define USBDMA7N USBDMA7N
extern volatile uint32_t   USBDMA7N __attribute__((section("sfrs"), address(0xBF8E326C)));
typedef struct {
  uint32_t DMACOUNT:32;
} __USBDMA7Nbits_t;
extern volatile __USBDMA7Nbits_t USBDMA7Nbits __asm__ ("USBDMA7N") __attribute__((section("sfrs"), address(0xBF8E326C)));
#define USBDMA8C USBDMA8C
extern volatile uint32_t   USBDMA8C __attribute__((section("sfrs"), address(0xBF8E3274)));
typedef struct {
  uint32_t DMAEN:1;
  uint32_t DMADIR:1;
  uint32_t DMAMODE:1;
  uint32_t DMAIE:1;
  uint32_t DMAEP:4;
  uint32_t DMAERR:1;
  uint32_t DMABRSTM:2;
} __USBDMA8Cbits_t;
extern volatile __USBDMA8Cbits_t USBDMA8Cbits __asm__ ("USBDMA8C") __attribute__((section("sfrs"), address(0xBF8E3274)));
#define USBDMA8A USBDMA8A
extern volatile uint32_t   USBDMA8A __attribute__((section("sfrs"), address(0xBF8E3278)));
typedef struct {
  uint32_t DMAADDR:32;
} __USBDMA8Abits_t;
extern volatile __USBDMA8Abits_t USBDMA8Abits __asm__ ("USBDMA8A") __attribute__((section("sfrs"), address(0xBF8E3278)));
#define USBDMA8N USBDMA8N
extern volatile uint32_t   USBDMA8N __attribute__((section("sfrs"), address(0xBF8E327C)));
typedef struct {
  uint32_t DMACOUNT:32;
} __USBDMA8Nbits_t;
extern volatile __USBDMA8Nbits_t USBDMA8Nbits __asm__ ("USBDMA8N") __attribute__((section("sfrs"), address(0xBF8E327C)));
#define USBE1RPC USBE1RPC
extern volatile uint32_t   USBE1RPC __attribute__((section("sfrs"), address(0xBF8E3304)));
typedef struct {
  uint32_t RQPKTCNT:16;
} __USBE1RPCbits_t;
extern volatile __USBE1RPCbits_t USBE1RPCbits __asm__ ("USBE1RPC") __attribute__((section("sfrs"), address(0xBF8E3304)));
#define USBE2RPC USBE2RPC
extern volatile uint32_t   USBE2RPC __attribute__((section("sfrs"), address(0xBF8E3308)));
typedef struct {
  uint32_t RQPKTCNT:16;
} __USBE2RPCbits_t;
extern volatile __USBE2RPCbits_t USBE2RPCbits __asm__ ("USBE2RPC") __attribute__((section("sfrs"), address(0xBF8E3308)));
#define USBE3RPC USBE3RPC
extern volatile uint32_t   USBE3RPC __attribute__((section("sfrs"), address(0xBF8E330C)));
typedef struct {
  uint32_t RQPKTCNT:16;
} __USBE3RPCbits_t;
extern volatile __USBE3RPCbits_t USBE3RPCbits __asm__ ("USBE3RPC") __attribute__((section("sfrs"), address(0xBF8E330C)));
#define USBE4RPC USBE4RPC
extern volatile uint32_t   USBE4RPC __attribute__((section("sfrs"), address(0xBF8E3310)));
typedef struct {
  uint32_t RQPKTCNT:16;
} __USBE4RPCbits_t;
extern volatile __USBE4RPCbits_t USBE4RPCbits __asm__ ("USBE4RPC") __attribute__((section("sfrs"), address(0xBF8E3310)));
#define USBE5RPC USBE5RPC
extern volatile uint32_t   USBE5RPC __attribute__((section("sfrs"), address(0xBF8E3314)));
typedef struct {
  uint32_t RQPKTCNT:16;
} __USBE5RPCbits_t;
extern volatile __USBE5RPCbits_t USBE5RPCbits __asm__ ("USBE5RPC") __attribute__((section("sfrs"), address(0xBF8E3314)));
#define USBE6RPC USBE6RPC
extern volatile uint32_t   USBE6RPC __attribute__((section("sfrs"), address(0xBF8E3318)));
typedef struct {
  uint32_t RQPKTCNT:16;
} __USBE6RPCbits_t;
extern volatile __USBE6RPCbits_t USBE6RPCbits __asm__ ("USBE6RPC") __attribute__((section("sfrs"), address(0xBF8E3318)));
#define USBE7RPC USBE7RPC
extern volatile uint32_t   USBE7RPC __attribute__((section("sfrs"), address(0xBF8E331C)));
typedef struct {
  uint32_t RQPKTCNT:16;
} __USBE7RPCbits_t;
extern volatile __USBE7RPCbits_t USBE7RPCbits __asm__ ("USBE7RPC") __attribute__((section("sfrs"), address(0xBF8E331C)));
#define USBDPBFD USBDPBFD
extern volatile uint32_t   USBDPBFD __attribute__((section("sfrs"), address(0xBF8E3340)));
typedef struct {
  uint32_t :1;
  uint32_t EP1RXD:1;
  uint32_t EP2RXD:1;
  uint32_t EP3RXD:1;
  uint32_t EP4RXD:1;
  uint32_t EP5RXD:1;
  uint32_t EP6RXD:1;
  uint32_t EP7RXD:1;
  uint32_t :9;
  uint32_t EP1TXD:1;
  uint32_t EP2TXD:1;
  uint32_t EP3TXD:1;
  uint32_t EP4TXD:1;
  uint32_t EP5TXD:1;
  uint32_t EP6TXD:1;
  uint32_t EP7TXD:1;
} __USBDPBFDbits_t;
extern volatile __USBDPBFDbits_t USBDPBFDbits __asm__ ("USBDPBFD") __attribute__((section("sfrs"), address(0xBF8E3340)));
#define USBTMCON1 USBTMCON1
extern volatile uint32_t   USBTMCON1 __attribute__((section("sfrs"), address(0xBF8E3344)));
typedef struct {
  uint32_t TUCH:16;
  uint32_t THHSRTN:16;
} __USBTMCON1bits_t;
extern volatile __USBTMCON1bits_t USBTMCON1bits __asm__ ("USBTMCON1") __attribute__((section("sfrs"), address(0xBF8E3344)));
#define USBTMCON2 USBTMCON2
extern volatile uint32_t   USBTMCON2 __attribute__((section("sfrs"), address(0xBF8E3348)));
typedef struct {
  uint32_t THSBT:4;
} __USBTMCON2bits_t;
extern volatile __USBTMCON2bits_t USBTMCON2bits __asm__ ("USBTMCON2") __attribute__((section("sfrs"), address(0xBF8E3348)));
#define USBLPMR1 USBLPMR1
extern volatile uint32_t   USBLPMR1 __attribute__((section("sfrs"), address(0xBF8E3360)));
typedef struct {
  uint32_t LNKSTATE:4;
  uint32_t HIRD:4;
  uint32_t RMTWAK:1;
  uint32_t :3;
  uint32_t ENDPOINT:4;
  uint32_t LPMXMT:1;
  uint32_t LPMRES:1;
  uint32_t LPMEN:2;
  uint32_t LPMNAK:1;
  uint32_t :3;
  uint32_t LPMTOIE:1;
  uint32_t LPMSTIE:1;
  uint32_t LPMNYIE:1;
  uint32_t LPMACKIE:1;
  uint32_t LPMRESIE:1;
  uint32_t LPMERRIE:1;
} __USBLPMR1bits_t;
extern volatile __USBLPMR1bits_t USBLPMR1bits __asm__ ("USBLPMR1") __attribute__((section("sfrs"), address(0xBF8E3360)));
#define USBLMPR2 USBLMPR2
extern volatile uint32_t   USBLMPR2 __attribute__((section("sfrs"), address(0xBF8E3364)));
typedef struct {
  uint32_t LPMST:1;
  uint32_t LPMNY:1;
  uint32_t LPMACK:1;
  uint32_t LPMNC:1;
  uint32_t LPMRES:1;
  uint32_t LPMERR:1;
  uint32_t :2;
  uint32_t LPMFADDR:7;
} __USBLMPR2bits_t;
extern volatile __USBLMPR2bits_t USBLMPR2bits __asm__ ("USBLMPR2") __attribute__((section("sfrs"), address(0xBF8E3364)));
#define USBLPMP2 USBLPMP2
extern volatile uint32_t   USBLPMP2 __attribute__((section("sfrs"), address(0xBF8E3364)));
typedef struct {
  uint32_t LPMST:1;
  uint32_t LPMNY:1;
  uint32_t LPMACK:1;
  uint32_t LPMNC:1;
  uint32_t LPMRES:1;
  uint32_t LPMERR:1;
  uint32_t :2;
  uint32_t LPMFADDR:7;
} __USBLPMP2bits_t;
extern volatile __USBLPMP2bits_t USBLPMP2bits __asm__ ("USBLPMP2") __attribute__((section("sfrs"), address(0xBF8E3364)));
#define RNGVER RNGVER
extern volatile uint32_t   RNGVER __attribute__((section("sfrs"), address(0xBF8E6000)));
typedef struct {
  uint32_t REVISION:7;
  uint32_t VERSION:9;
  uint32_t ID:16;
} __RNGVERbits_t;
extern volatile __RNGVERbits_t RNGVERbits __asm__ ("RNGVER") __attribute__((section("sfrs"), address(0xBF8E6000)));
#define RNGCON RNGCON
extern volatile uint32_t   RNGCON __attribute__((section("sfrs"), address(0xBF8E6004)));
typedef struct {
  uint32_t PLEN:8;
  uint32_t TRNGEN:1;
  uint32_t PRNGEN:1;
  uint32_t CONT:1;
  uint32_t TRNGMODE:1;
  uint32_t LOAD:1;
} __RNGCONbits_t;
extern volatile __RNGCONbits_t RNGCONbits __asm__ ("RNGCON") __attribute__((section("sfrs"), address(0xBF8E6004)));
#define RNGPOLY1 RNGPOLY1
extern volatile uint32_t   RNGPOLY1 __attribute__((section("sfrs"), address(0xBF8E6008)));
typedef struct {
  uint32_t POLY:32;
} __RNGPOLY1bits_t;
extern volatile __RNGPOLY1bits_t RNGPOLY1bits __asm__ ("RNGPOLY1") __attribute__((section("sfrs"), address(0xBF8E6008)));
#define RNGPOLY2 RNGPOLY2
extern volatile uint32_t   RNGPOLY2 __attribute__((section("sfrs"), address(0xBF8E600C)));
typedef struct {
  uint32_t POLY:32;
} __RNGPOLY2bits_t;
extern volatile __RNGPOLY2bits_t RNGPOLY2bits __asm__ ("RNGPOLY2") __attribute__((section("sfrs"), address(0xBF8E600C)));
#define RNGNUMGEN1 RNGNUMGEN1
extern volatile uint32_t   RNGNUMGEN1 __attribute__((section("sfrs"), address(0xBF8E6010)));
typedef struct {
  uint32_t RNG:32;
} __RNGNUMGEN1bits_t;
extern volatile __RNGNUMGEN1bits_t RNGNUMGEN1bits __asm__ ("RNGNUMGEN1") __attribute__((section("sfrs"), address(0xBF8E6010)));
#define RNGNUMGEN2 RNGNUMGEN2
extern volatile uint32_t   RNGNUMGEN2 __attribute__((section("sfrs"), address(0xBF8E6014)));
typedef struct {
  uint32_t RNG:32;
} __RNGNUMGEN2bits_t;
extern volatile __RNGNUMGEN2bits_t RNGNUMGEN2bits __asm__ ("RNGNUMGEN2") __attribute__((section("sfrs"), address(0xBF8E6014)));
#define RNGSEED1 RNGSEED1
extern volatile uint32_t   RNGSEED1 __attribute__((section("sfrs"), address(0xBF8E6018)));
typedef struct {
  uint32_t SEED:32;
} __RNGSEED1bits_t;
extern volatile __RNGSEED1bits_t RNGSEED1bits __asm__ ("RNGSEED1") __attribute__((section("sfrs"), address(0xBF8E6018)));
#define RNGSEED2 RNGSEED2
extern volatile uint32_t   RNGSEED2 __attribute__((section("sfrs"), address(0xBF8E601C)));
typedef struct {
  uint32_t SEED:32;
} __RNGSEED2bits_t;
extern volatile __RNGSEED2bits_t RNGSEED2bits __asm__ ("RNGSEED2") __attribute__((section("sfrs"), address(0xBF8E601C)));
#define RNGCNT RNGCNT
extern volatile uint32_t   RNGCNT __attribute__((section("sfrs"), address(0xBF8E6020)));
typedef struct {
  uint32_t RCNT:7;
} __RNGCNTbits_t;
extern volatile __RNGCNTbits_t RNGCNTbits __asm__ ("RNGCNT") __attribute__((section("sfrs"), address(0xBF8E6020)));
#define SBFLAG SBFLAG
extern volatile uint32_t   SBFLAG __attribute__((section("sfrs"), address(0xBF8F0510)));
typedef struct {
  uint32_t T0PGV:1;
  uint32_t T1PGV:1;
  uint32_t T2PGV:1;
  uint32_t T3PGV:1;
  uint32_t T4PGV:1;
  uint32_t T5PGV:1;
  uint32_t T6PGV:1;
  uint32_t T7PGV:1;
  uint32_t T8PGV:1;
  uint32_t T9PGV:1;
  uint32_t T10PGV:1;
  uint32_t T11PGV:1;
  uint32_t T12PGV:1;
  uint32_t T13PGV:1;
} __SBFLAGbits_t;
