MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ0512EFF100/mcu.h
#define _OFF120_VOFF_POSITION                    0x00000001
#define _OFF120_VOFF_MASK                        0x0003FFFE
#define _OFF120_VOFF_LENGTH                      0x00000011

#define _OFF121_VOFF_POSITION                    0x00000001
#define _OFF121_VOFF_MASK                        0x0003FFFE
#define _OFF121_VOFF_LENGTH                      0x00000011

#define _OFF122_VOFF_POSITION                    0x00000001
#define _OFF122_VOFF_MASK                        0x0003FFFE
#define _OFF122_VOFF_LENGTH                      0x00000011

#define _OFF123_VOFF_POSITION                    0x00000001
#define _OFF123_VOFF_MASK                        0x0003FFFE
#define _OFF123_VOFF_LENGTH                      0x00000011

#define _OFF124_VOFF_POSITION                    0x00000001
#define _OFF124_VOFF_MASK                        0x0003FFFE
#define _OFF124_VOFF_LENGTH                      0x00000011

#define _OFF128_VOFF_POSITION                    0x00000001
#define _OFF128_VOFF_MASK                        0x0003FFFE
#define _OFF128_VOFF_LENGTH                      0x00000011

#define _OFF129_VOFF_POSITION                    0x00000001
#define _OFF129_VOFF_MASK                        0x0003FFFE
#define _OFF129_VOFF_LENGTH                      0x00000011

#define _OFF130_VOFF_POSITION                    0x00000001
#define _OFF130_VOFF_MASK                        0x0003FFFE
#define _OFF130_VOFF_LENGTH                      0x00000011

#define _OFF131_VOFF_POSITION                    0x00000001
#define _OFF131_VOFF_MASK                        0x0003FFFE
#define _OFF131_VOFF_LENGTH                      0x00000011

#define _OFF132_VOFF_POSITION                    0x00000001
#define _OFF132_VOFF_MASK                        0x0003FFFE
#define _OFF132_VOFF_LENGTH                      0x00000011

#define _OFF133_VOFF_POSITION                    0x00000001
#define _OFF133_VOFF_MASK                        0x0003FFFE
#define _OFF133_VOFF_LENGTH                      0x00000011

#define _OFF134_VOFF_POSITION                    0x00000001
#define _OFF134_VOFF_MASK                        0x0003FFFE
#define _OFF134_VOFF_LENGTH                      0x00000011

#define _OFF135_VOFF_POSITION                    0x00000001
#define _OFF135_VOFF_MASK                        0x0003FFFE
#define _OFF135_VOFF_LENGTH                      0x00000011

#define _OFF136_VOFF_POSITION                    0x00000001
#define _OFF136_VOFF_MASK                        0x0003FFFE
#define _OFF136_VOFF_LENGTH                      0x00000011

#define _OFF137_VOFF_POSITION                    0x00000001
#define _OFF137_VOFF_MASK                        0x0003FFFE
#define _OFF137_VOFF_LENGTH                      0x00000011

#define _OFF138_VOFF_POSITION                    0x00000001
#define _OFF138_VOFF_MASK                        0x0003FFFE
#define _OFF138_VOFF_LENGTH                      0x00000011

#define _OFF139_VOFF_POSITION                    0x00000001
#define _OFF139_VOFF_MASK                        0x0003FFFE
#define _OFF139_VOFF_LENGTH                      0x00000011

#define _OFF140_VOFF_POSITION                    0x00000001
#define _OFF140_VOFF_MASK                        0x0003FFFE
#define _OFF140_VOFF_LENGTH                      0x00000011

#define _OFF141_VOFF_POSITION                    0x00000001
#define _OFF141_VOFF_MASK                        0x0003FFFE
#define _OFF141_VOFF_LENGTH                      0x00000011

#define _OFF142_VOFF_POSITION                    0x00000001
#define _OFF142_VOFF_MASK                        0x0003FFFE
#define _OFF142_VOFF_LENGTH                      0x00000011

#define _OFF143_VOFF_POSITION                    0x00000001
#define _OFF143_VOFF_MASK                        0x0003FFFE
#define _OFF143_VOFF_LENGTH                      0x00000011

#define _OFF144_VOFF_POSITION                    0x00000001
#define _OFF144_VOFF_MASK                        0x0003FFFE
#define _OFF144_VOFF_LENGTH                      0x00000011

#define _OFF145_VOFF_POSITION                    0x00000001
#define _OFF145_VOFF_MASK                        0x0003FFFE
#define _OFF145_VOFF_LENGTH                      0x00000011

#define _OFF146_VOFF_POSITION                    0x00000001
#define _OFF146_VOFF_MASK                        0x0003FFFE
#define _OFF146_VOFF_LENGTH                      0x00000011

#define _OFF147_VOFF_POSITION                    0x00000001
#define _OFF147_VOFF_MASK                        0x0003FFFE
#define _OFF147_VOFF_LENGTH                      0x00000011

#define _OFF148_VOFF_POSITION                    0x00000001
#define _OFF148_VOFF_MASK                        0x0003FFFE
#define _OFF148_VOFF_LENGTH                      0x00000011

#define _OFF149_VOFF_POSITION                    0x00000001
#define _OFF149_VOFF_MASK                        0x0003FFFE
#define _OFF149_VOFF_LENGTH                      0x00000011

#define _OFF150_VOFF_POSITION                    0x00000001
#define _OFF150_VOFF_MASK                        0x0003FFFE
#define _OFF150_VOFF_LENGTH                      0x00000011

#define _OFF151_VOFF_POSITION                    0x00000001
#define _OFF151_VOFF_MASK                        0x0003FFFE
#define _OFF151_VOFF_LENGTH                      0x00000011

#define _OFF152_VOFF_POSITION                    0x00000001
#define _OFF152_VOFF_MASK                        0x0003FFFE
#define _OFF152_VOFF_LENGTH                      0x00000011

#define _OFF153_VOFF_POSITION                    0x00000001
#define _OFF153_VOFF_MASK                        0x0003FFFE
#define _OFF153_VOFF_LENGTH                      0x00000011

#define _OFF154_VOFF_POSITION                    0x00000001
#define _OFF154_VOFF_MASK                        0x0003FFFE
#define _OFF154_VOFF_LENGTH                      0x00000011

#define _OFF155_VOFF_POSITION                    0x00000001
#define _OFF155_VOFF_MASK                        0x0003FFFE
#define _OFF155_VOFF_LENGTH                      0x00000011

#define _OFF156_VOFF_POSITION                    0x00000001
#define _OFF156_VOFF_MASK                        0x0003FFFE
#define _OFF156_VOFF_LENGTH                      0x00000011

#define _OFF157_VOFF_POSITION                    0x00000001
#define _OFF157_VOFF_MASK                        0x0003FFFE
#define _OFF157_VOFF_LENGTH                      0x00000011

#define _OFF158_VOFF_POSITION                    0x00000001
#define _OFF158_VOFF_MASK                        0x0003FFFE
#define _OFF158_VOFF_LENGTH                      0x00000011

#define _OFF159_VOFF_POSITION                    0x00000001
#define _OFF159_VOFF_MASK                        0x0003FFFE
#define _OFF159_VOFF_LENGTH                      0x00000011

#define _OFF160_VOFF_POSITION                    0x00000001
#define _OFF160_VOFF_MASK                        0x0003FFFE
#define _OFF160_VOFF_LENGTH                      0x00000011

#define _OFF161_VOFF_POSITION                    0x00000001
#define _OFF161_VOFF_MASK                        0x0003FFFE
#define _OFF161_VOFF_LENGTH                      0x00000011

